tyalie/stm8-binutils-gdb/gas/config/tc-stm8.c
/* tc-stm8.c -- Assembler for the STM8.
   Written by Ake Rehnman 2017-02-21,
   ake.rehnman (at) gmail dot com

   Copyright (C) 2007-2017 Free Software Foundation, Inc.

   This file is part of BFD, the Binary File Descriptor library.

   This program is free software; you can redistribute it and/or modify
   it under the terms of the GNU General Public License as published by
   the Free Software Foundation; either version 3 of the License, or
   (at your option) any later version.

   This program is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   GNU General Public License for more details.

   You should have received a copy of the GNU General Public License
   along with this program; if not, write to the Free Software Foundation,
   Inc., 51 Franklin Street - Fifth Floor, Boston, MA 02110-1301, USA.  */

#include "as.h"
#include "opcode/stm8.h"
#include <ctype.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>

typedef enum
{
  OP_ILLEGAL = 0,
  OP_IMM,
  OP_SHORTMEM,
  OP_MEM,
  OP_INDX,
  OP_INDY,
  OP_OFF_X,
  OP_OFF_Y,
  OP_OFF_SP,
  OP_PTRW,
  OP_PTRE,
  OP_PTRW_X,
  OP_PTRW_Y,
  OP_PTRE_X,
  OP_PTRE_Y,
  OP_REGISTER
} stm8_operand_t;

static htab_t stm8_hash;

const char comment_chars[] = ";";
const char line_comment_chars[] = "#";
const char line_separator_chars[] = "{";

int md_short_jump_size = 3;
int md_long_jump_size = 4;

#ifdef DEBUG_STM8
int stm8_debug_dump = 0;
#endif

/* The target specific pseudo-ops which we support.  */
/* example:
const pseudo_typeS md_pseudo_table[] =
{
  {"arch", avr_set_arch,  0},
  { NULL, NULL,   0}
};
*/
const pseudo_typeS md_pseudo_table[] = { { NULL, NULL, 0 } };

const char EXP_CHARS[] = "eE";

/* Chars that mean this number is a floating point constant.
   As in 0f12.456
   or    0d1.2345e12  */
const char FLT_CHARS[] = "rRsSfFdDxXpP";

/* On the Z8000, a PC-relative offset is relative to the address of the
   instruction plus its size.  */
long
md_pcrel_from (fixS *fixP)
{
  return fixP->fx_size + fixP->fx_where + fixP->fx_frag->fr_address;
}

const char *
md_atof (int type, char *litP, int *sizeP)
{
  return ieee_md_atof (type, litP, sizeP, TRUE);
}

void
md_show_usage (FILE *stream)
{
  fprintf (stream, _ ("\
  STM8 options:\n\
  "));
#ifdef DEBUG_STM8
  fprintf (stream, _ ("\
  --debug               turn on debug messages\n"));
#endif
}

const char *md_shortopts = "";

struct option md_longopts[] = {
#ifdef DEBUG_STM8
  { "debug", no_argument, &stm8_debug_dump, 1 },
#endif
  { NULL, no_argument, NULL, 0 }
};

size_t md_longopts_size = sizeof (md_longopts);

int
md_parse_option (int c __attribute__ ((unused)),
                 const char *arg __attribute__ ((unused)))
{
  return 1;
}

void
md_begin (void)
{
  const struct stm8_opcodes_s *opcode;

  stm8_hash = str_htab_create ();

  /* Insert unique names into hash table.  This hash table then provides a
  quick index to the first opcode with a particular name in the opcode
  table.  */
  for (opcode = stm8_opcodes; opcode->name; opcode++)
    str_hash_insert (stm8_hash, opcode->name, (char *)opcode, 0);

  // add register names to symbol table

  symbol_table_insert (
      symbol_create ("A", reg_section, &zero_address_frag, ST8_REG_A));

  symbol_table_insert (
      symbol_create ("X", reg_section, &zero_address_frag, ST8_REG_X));

  symbol_table_insert (
      symbol_create ("Y", reg_section, &zero_address_frag, ST8_REG_Y));

  symbol_table_insert (
      symbol_create ("SP", reg_section, &zero_address_frag, ST8_REG_SP));

  symbol_table_insert (
      symbol_create ("CC", reg_section, &zero_address_frag, ST8_REG_CC));

  symbol_table_insert (
      symbol_create ("XL", reg_section, &zero_address_frag, ST8_REG_XL));

  symbol_table_insert (
      symbol_create ("XH", reg_section, &zero_address_frag, ST8_REG_XH));

  symbol_table_insert (
      symbol_create ("YL", reg_section, &zero_address_frag, ST8_REG_YL));

  symbol_table_insert (
      symbol_create ("YH", reg_section, &zero_address_frag, ST8_REG_YH));

  symbol_table_insert (
      symbol_create ("a", reg_section, &zero_address_frag, ST8_REG_A));

  symbol_table_insert (
      symbol_create ("x", reg_section, &zero_address_frag, ST8_REG_X));

  symbol_table_insert (
      symbol_create ("y", reg_section, &zero_address_frag, ST8_REG_Y));

  symbol_table_insert (
      symbol_create ("sp", reg_section, &zero_address_frag, ST8_REG_SP));

  symbol_table_insert (
      symbol_create ("cc", reg_section, &zero_address_frag, ST8_REG_CC));

  symbol_table_insert (
      symbol_create ("xl", reg_section, &zero_address_frag, ST8_REG_XL));

  symbol_table_insert (
      symbol_create ("xh", reg_section, &zero_address_frag, ST8_REG_XH));

  symbol_table_insert (
      symbol_create ("yl", reg_section, &zero_address_frag, ST8_REG_YL));

  symbol_table_insert (
      symbol_create ("yh", reg_section, &zero_address_frag, ST8_REG_YH));
}

static inline char *
skip_space (char *s)
{
  while (*s == ' ' || *s == '\t')
    ++s;
  return s;
}

/* Extract one word from FROM and copy it to TO.  */

static char *
extract_word (char *from, char *to, int limit)
{
  char *op_end;
  int size = 0;

  /* Drop leading whitespace.  */
  from = skip_space (from);
  *to = 0;

  /* Find the op code end.  */
  for (op_end = from; *op_end != 0 && is_part_of_name (*op_end);)
    {
      to[size++] = *op_end++;
      if (size + 1 >= limit)
        break;
    }

  to[size] = 0;
  return op_end;
}

void
md_operand (expressionS *exp __attribute__ ((unused)))
{
  /* In case of a syntax error, escape back to try next syntax combo.  */
  as_bad (_ ("stm8: call to md_operand"));
}

/* Attempt to simplify or eliminate a fixup. To indicate that a fixup
   has been eliminated, set fix->fx_done. If fix->fx_addsy is non-NULL,
   we will have to generate a reloc entry.  */
void
md_apply_fix (fixS *fixP, valueT *valP, segT segment ATTRIBUTE_UNUSED)
{
  long val = *(long *)valP;
  char *buf = fixP->fx_where + fixP->fx_frag->fr_literal;

  DEBUG_TRACE_FIXUP (fixP);

  switch (fixP->fx_r_type)
    {
    case BFD_RELOC_8:
      if (fixP->fx_addsy)
        {
          fixP->fx_no_overflow = 1;
          fixP->fx_done = 0;
        }
      else
        *buf++ = val;
      break;

    case BFD_RELOC_16:
      if (fixP->fx_addsy)
        {
          fixP->fx_no_overflow = 1;
          fixP->fx_done = 0;
        }
      else
        {
          *buf++ = (val >> 8);
          *buf++ = val;
        }
      break;

    case BFD_RELOC_24:
      if (fixP->fx_addsy)
        {
          fixP->fx_no_overflow = 1;
          fixP->fx_done = 0;
          fixP->fx_where--;
        }
      else
        {
          *buf++ = (val >> 16);
          *buf++ = (val >> 8);
          *buf++ = val;
        }
      break;

    case BFD_RELOC_32:
      if (fixP->fx_addsy)
        {
          fixP->fx_no_overflow = 1;
          fixP->fx_done = 0;
        }
      else
        {
          *buf++ = (val >> 24);
          *buf++ = (val >> 16);
          *buf++ = (val >> 8);
          *buf++ = val;
        }
      break;

    case BFD_RELOC_8_PCREL:
      if (fixP->fx_addsy)
        {
          fixP->fx_pcrel_adjust = -1;
          fixP->fx_no_overflow = 1;
          fixP->fx_done = 0;
        }
      else
        {
          if (val > 127 || val < -128)
            as_bad_where (fixP->fx_file, fixP->fx_line,
                          _ ("relative jump out of range"));
          *buf++ = val;
          fixP->fx_no_overflow = 1;
          fixP->fx_done = 1;
        }
      break;

