tyalie/stm8-binutils-gdb/gas/config/tc-stm8.c
    case BFD_RELOC_STM8_BIT_FLD:
      if (val > 7 || val < 0)
        as_bad_where (fixP->fx_file, fixP->fx_line,
                      _ ("bitfield out of range %ld"), val);
      *buf++ += val * 2;
      fixP->fx_no_overflow = 1;
      fixP->fx_done = 1;
      break;

    default:
      printf (_ ("md_apply_fix: unknown r_type 0x%x\n"), fixP->fx_r_type);
      abort ();
    }

  if (fixP->fx_addsy == NULL && fixP->fx_pcrel == 0)
    fixP->fx_done = 1;
}

/* Generate a machine dependent reloc from a fixup.  */

arelent *
tc_gen_reloc (asection *section ATTRIBUTE_UNUSED, fixS *fixp ATTRIBUTE_UNUSED)
{
  arelent *reloc;

  DEBUG_TRACE_FIXUP (fixp);

  reloc = XNEW (arelent);
  reloc->sym_ptr_ptr = XNEW (asymbol *);
  *reloc->sym_ptr_ptr = symbol_get_bfdsym (fixp->fx_addsy);
  reloc->address = fixp->fx_frag->fr_address + fixp->fx_where;
  reloc->addend = fixp->fx_offset;
  if (fixp->fx_r_type == BFD_RELOC_8_PCREL)
    reloc->addend = fixp->fx_offset + fixp->fx_pcrel_adjust;
  reloc->howto = bfd_reloc_type_lookup (stdoutput, fixp->fx_r_type);

  if (!reloc->howto)
    {
      as_bad_where (fixp->fx_file, fixp->fx_line,
                    _ ("Cannot represent %s relocation in object file"),
                    bfd_get_reloc_code_name (fixp->fx_r_type));
      abort ();
    }
  return reloc;
}

valueT
md_section_align (segT seg, valueT size)
{
  int align = bfd_section_alignment (seg);
  valueT mask = ((valueT)1 << align) - 1;

  return (size + mask) & ~mask;
}

symbolS *
md_undefined_symbol (char *name)
{
  return 0;
  // Hande the case where a symbol has .w or .e suffix attached.
  // This is actually quite stupid because the operand length is the
  // same independent of whether it is .w or .e
  char *p;
  symbolS *symbolP = NULL;

  if ((p = strstr (name, ".w")))
    {
      if (*(p + 2) == 0)
        {
          *p = 0;
          symbolP = symbol_find (name);
          //*p = '.';
        }
    }
  if ((p = strstr (name, ".l")))
    {
      if (*(p + 2) == 0)
        {
          *p = 0;
          symbolP = symbol_find (name);
          //*p = '.';
        }
    }
  if ((p = strstr (name, ".e")))
    {
      if (*(p + 2) == 0)
        {
          *p = 0;
          symbolP = symbol_find (name);
          //*p = '.';
        }
    }
  return symbolP;
}

void
md_create_long_jump (char *ptr __attribute__ ((unused)),
                     addressT from_addr ATTRIBUTE_UNUSED,
                     addressT to_addr __attribute__ ((unused)),
                     fragS *frag __attribute__ ((unused)),
                     symbolS *to_symbol __attribute__ ((unused)))
{
  as_bad (_ ("long_jump"));
}

void
md_create_short_jump (char *ptr __attribute__ ((unused)),
                      addressT from_addr __attribute__ ((unused)),
                      addressT to_addr ATTRIBUTE_UNUSED,
                      fragS *frag ATTRIBUTE_UNUSED,
                      symbolS *to_symbol ATTRIBUTE_UNUSED)
{
  as_bad (_ ("short_jump"));
}

/* Put number into target byte order.  */

void
md_number_to_chars (char *ptr, valueT use, int nbytes)
{
  number_to_chars_bigendian (ptr, use, nbytes);
}

int
md_estimate_size_before_relax (fragS *fragP ATTRIBUTE_UNUSED,
                               segT segment_type ATTRIBUTE_UNUSED)
{
  as_bad (_ ("call to md_estimate_size_before_relax\n"));
  return 0;
}

void
md_convert_frag (bfd *abfd ATTRIBUTE_UNUSED, segT sec ATTRIBUTE_UNUSED,
                 fragS *fragP ATTRIBUTE_UNUSED)
{
  as_bad (_ ("call to md_convert_frag\n"));
}

static char *
match_parentheses (char *str)
{
  char *p;
  int cnt = 0;

  p = str;
  while (*p != 0)
    {
      if (*p == '(')
        cnt++;
      if (*p == ')')
        {
          if (--cnt == 0)
            return p;
        }
      p++;
    }
  return 0;
}

static int
split_words (char *str, char **chunks)
{
  int i;
  char *p;

  p = str;
  for (i = 0; i < 3; i++)
    {
      chunks[i] = str;
      if (*str == 0)
        break;
      while (*p != 0)
        {
          if (*p == '(')
            {
              p = match_parentheses (str);
              if (p == 0)
                return 0;
            }
          if (*p == ',')
            {
              *p = 0;
              p++;
              break;
            }
          p++;
        }
      str = p;
    }
  return i;
}

static int
read_arg_ptr (char *str, expressionS *exps)
{
  char *s;
  char *p;
  char c;

  if ((str[0] == '[') && (strstr (str, "]")))
    {
      s = str;
      s++;
      input_line_pointer = s;

      /* first eat up .w and .e */
      if ((p = strstr (s, ".w]")))
        {
          c = *p;
          *p = 0;
        }
      else if ((p = strstr (s, ".e]")))
        {
          c = *p;
          *p = 0;
        }

      expression (exps);
      DEBUG_TRACE_EXPR (exps);

      /* restore c */
      if (p)
        *p = c;

      // return default pointer len
      if (*input_line_pointer == ']')
        {
          input_line_pointer += 1;
          return 2;
        }
      else if ((*input_line_pointer == '.')
               && (*(input_line_pointer + 1) == 'w'))
        {
          input_line_pointer += 2;
          return 2;
        }
      else if ((*input_line_pointer == '.')
               && (*(input_line_pointer + 1) == 'e'))
        {
          input_line_pointer += 2;
          return 3;
        }
      else
        {
          as_bad ("Expected ']' or '.e' or '.w' but found '%c'",
                  *input_line_pointer);
          return -1;
        }
    }
  return 0;
}

char *toupperstr (char *str);

char *
toupperstr (char *str)
{
  int i;
  for (i = 0; str[i]; i++)
    {
      str[i] = toupper (str[i]);
    }
  return str;
}

// expressionS last_exp;
/* In: argument
   Out: value
   Modifies: type */
static int
read_arg (char *str, expressionS *exps)
{
  int ret;
  const char *name ATTRIBUTE_UNUSED;
  /* There is a number of addressing modes in ST8 architecture.
We need to properly handle each of them in order to find a proper opcode. */
  if (!str)
    return (0);

  // Immidate
  if (str[0] == '#')
    {
      str++;
      exps->X_md = OP_IMM;
      input_line_pointer = str;
      expression (exps);
      DEBUG_TRACE_EXPR (exps);
      return 1;
    }

