tyalie/stm8-binutils-gdb/gas/config/tc-stm8.c
  char strx[256];
  strncpy (strx, str, sizeof (strx) - 1);
  toupperstr (strx);

  // decode ptr operand
  if (str[0] == '[')
    {
      ret = read_arg_ptr (str, exps);
      if (ret > 0)
        {
          if (ret == 2)
            {
              exps->X_md = OP_PTRW;
              return 1;
            }
          if (ret == 3)
            {
              exps->X_md = OP_PTRE;
              return 1;
            }
        }
      else
        return 0;
    }
  // decode index operands
  // index X
  else if ((str[0] == '(') && (strstr (strx, "(X)")))
    {
      exps->X_md = OP_INDX;
      return 1;
    }
  // index Y
  else if ((str[0] == '(') && (strstr (strx, "(Y)")))
    {
      exps->X_md = OP_INDY;
      return 1;
    }
  // offset,X
  else if ((str[0] == '(') && (strstr (strx, ",X)")))
    {
      str++;
      if (str[0] == '[')
        {
          ret = read_arg_ptr (str, exps);
          if (ret == 2)
            {
              exps->X_md = OP_PTRW_X;
              return 1;
            }
          if (ret == 3)
            {
              exps->X_md = OP_PTRE_X;
              return 1;
            }
          return 0;
        }
      str = strtok (str, ",");
      input_line_pointer = str;
      expression (exps);
      DEBUG_TRACE_EXPR (exps);
      exps->X_md = OP_OFF_X;
      return 1;
    }
  // offset,Y
  else if ((str[0] == '(') && (strstr (strx, ",Y)")))
    {
      str++;
      if (str[0] == '[')
        {
          ret = read_arg_ptr (str, exps);
          if (ret == 2)
            {
              exps->X_md = OP_PTRW_Y;
              return 1;
            }
          if (ret == 3)
            {
              exps->X_md = OP_PTRE_Y;
              return 1;
            }
          return 0;
        }
      str = strtok (str, ",");
      input_line_pointer = str;
      expression (exps);
      DEBUG_TRACE_EXPR (exps);
      exps->X_md = OP_OFF_Y;
      return 1;
    }
  // offset,SP
  else if ((str[0] == '(') && (strstr (strx, ",SP)")))
    {
      str++;
      str = strtok (str, ",");
      input_line_pointer = str;
      expression (exps);
      DEBUG_TRACE_EXPR (exps);
      exps->X_md = OP_OFF_SP;
      return 1;
    }

  char *p;
  char c;
  if ((p = strstr (str, ".short")))
    {
      c = *p;
      *p = 0;
      exps->X_md = OP_SHORTMEM;
      input_line_pointer = str;
      expression (exps);
      DEBUG_TRACE_EXPR (exps);
      *p = c;
      input_line_pointer += 6;
      return 1;
    }

  input_line_pointer = str;
  expression (exps);
  DEBUG_TRACE_EXPR (exps);

  if (exps->X_op == O_register)
    {
      exps->X_md = OP_REGISTER;
      return 1;
    }

  if (exps->X_op != O_illegal)
    {
      exps->X_md = OP_MEM;
      return 1;
    }

  /* Can't parse an expression, notifying caller about that. */
  return (0);
}

static int
read_args (char *str, expressionS exps[])
{
  char *chunks[3];
  int count = split_words (str, chunks);
  int i;
  for (i = 0; i < count; i++)
    {
      int ret = read_arg (chunks[i], &(exps[i]));
      if (!ret)
        as_bad ("Invalid operand: %s", chunks[i]);
    }
  return (count);
}

static void
stm8_bfd_out (struct stm8_opcodes_s op, expressionS exp[], int count,
              char *frag)
{
  int i;
  int arg = 0;
  int dir = 1;

  if (count < 0)
    {
      count = -count;
      arg = count - 1;
      dir = -1;
    }

  for (i = 0; i < count; i++, arg += dir)
    {
      int where = frag - frag_now->fr_literal;

      if (exp[arg].X_op != O_illegal)
        {
          switch (op.constraints[arg])
            {
            case ST8_EXTMEM:
            case ST8_EXTOFF_X:
            case ST8_EXTOFF_Y:
              fix_new_exp (frag_now, where, 3, &exp[arg], FALSE, BFD_RELOC_24);
              bfd_put_bits (0xaaaaaaaa, frag, 24, true);
              frag += 3;
              break;
            case ST8_LONGPTRW_Y:
            case ST8_LONGPTRW_X:
            case ST8_LONGPTRW:
            case ST8_LONGPTRE:
            case ST8_LONGOFF_Y:
            case ST8_LONGOFF_X:
            case ST8_WORD:
            case ST8_LONGMEM:
              fix_new_exp (frag_now, where, 2, &exp[arg], FALSE, BFD_RELOC_16);
              bfd_put_bits (0xaaaaaaaa, frag, 16, true);
              frag += 2;
              break;
            case ST8_SHORTPTRW_Y:
            case ST8_SHORTPTRW_X:
            case ST8_SHORTPTRW:
            case ST8_SHORTOFF_Y:
            case ST8_SHORTOFF_X:
            case ST8_SHORTOFF_SP:
            case ST8_BYTE:
            case ST8_SHORTMEM:
              fix_new_exp (frag_now, where, 1, &exp[arg], FALSE, BFD_RELOC_8);
              bfd_put_bits (0xaaaaaaaa, frag, 8, true);
              frag += 1;
              break;
            case ST8_PCREL:
              fix_new_exp (frag_now, where, 1, &exp[arg], TRUE,
                           BFD_RELOC_8_PCREL);
              bfd_put_bits (0xaaaaaaaa, frag, 8, true);
              frag += 1;
              break;
            case ST8_BIT_0:
              fix_new_exp (frag_now, where - 3, 1, &exp[arg], FALSE,
                           BFD_RELOC_STM8_BIT_FLD);
              break;
            default:
              break;
            }
        }
    }
}

static int
cmpspec (stm8_addr_mode_t addr_mode[], expressionS exps[], int count)
{
  int i, ret = 0;
  unsigned int value;
  stm8_operand_t operand;

  for (i = 0; i < count; i++)
    {
      operand = exps[i].X_md;
      if (!addr_mode || !operand)
        continue; // End
      if (exps[i].X_op == O_constant)
        value = exps[i].X_add_number;
      else
        value = -1;

      switch (operand)
        {
        case OP_REGISTER:
          if (addr_mode[i] == (stm8_addr_mode_t)exps[i].X_add_number)
            continue;
          break;
        case OP_IMM:
          if (addr_mode[i] == ST8_BYTE)
            continue;
          if (addr_mode[i] == ST8_WORD)
            continue;
          if (addr_mode[i] == ST8_BIT_0)
            continue;
          break;
        case OP_INDX:
          if (addr_mode[i] == ST8_INDX)
            continue;
          break;
        case OP_INDY:
          if (addr_mode[i] == ST8_INDY)
            continue;
          break;
        case OP_OFF_X:
          if (addr_mode[i] == ST8_SHORTOFF_X)
            if (value < 0x100)
              continue;
          if (addr_mode[i] == ST8_LONGOFF_X)
            continue;
          if (addr_mode[i] == ST8_EXTOFF_X)
            continue;
          break;
        case OP_OFF_Y:
          if (addr_mode[i] == ST8_SHORTOFF_Y)
            if (value < 0x100)
              continue;
          if (addr_mode[i] == ST8_LONGOFF_Y)
            continue;
          if (addr_mode[i] == ST8_EXTOFF_Y)
            continue;
          break;
        case OP_OFF_SP:
          if (addr_mode[i] == ST8_SHORTOFF_SP)
            continue;
          break;
        case OP_PTRW:
          if (addr_mode[i] == ST8_SHORTPTRW)
            if (value < 0x100)
              continue;
          if (addr_mode[i] == ST8_LONGPTRW)
            continue;
          break;
        case OP_PTRW_X:
          if (addr_mode[i] == ST8_SHORTPTRW_X)
            if (value < 0x100)
              continue;
          if (addr_mode[i] == ST8_LONGPTRW_X)
            continue;
          break;
        case OP_PTRW_Y:
          if (addr_mode[i] == ST8_SHORTPTRW_Y)
            if (value < 0x100)
              continue;
          if (addr_mode[i] == ST8_LONGPTRW_Y)
            continue;
          break;
        case OP_PTRE:
          if (addr_mode[i] == ST8_LONGPTRE)
            continue;
          break;
        case OP_PTRE_X:
          if (addr_mode[i] == ST8_LONGPTRE_X)
            continue;
          break;
        case OP_PTRE_Y:
          if (addr_mode[i] == ST8_LONGPTRE_Y)
            continue;
          break;
        case OP_MEM:
          if (addr_mode[i] == ST8_PCREL)
            continue;
          if (addr_mode[i] == ST8_EXTMEM)
            continue;
          if (addr_mode[i] == ST8_LONGMEM)
            continue;
          break;
        case OP_SHORTMEM:
          if (addr_mode[i] == ST8_SHORTMEM)
            continue;
          break;
        case OP_ILLEGAL:
          as_fatal (_ ("BUG: OP_ILLEGAL"));
          return 1;
        }

      // not a match
      ret++;
    }
  return (ret);
}

/* This is the guts of the machine-dependent assembler.  STR points to a
   machine dependent instruction.  This function is supposed to emit
   the frags/bytes it assembles to.  */

void
md_assemble (char *str)
{
  char op[11];
  char *t = input_line_pointer;
  char *str_orig = strdup (str);
  str = skip_space (extract_word (str, op, sizeof (op)));
  // stm8_operand_t spec[3];
  expressionS exps[3];
  // memset(spec, 0, sizeof(stm8_operand_t) * 3);
  memset (exps, 0, sizeof (expressionS) * 3);

  int count = read_args (str, exps);
  struct stm8_opcodes_s *opcode
      = (struct stm8_opcodes_s *)str_hash_find (stm8_hash, op);

  if (opcode == NULL)
    {
      as_bad (_ ("unknown opcode `%s'"), op);
      return;
    }

