tyalie/stm8-binutils-gdb/gas/config/tc-stm8.c
  int i;
  for (i = 0; opcode[i].name != NULL; i++)
    {
      if (!strcmp (op, opcode[i].name))
        if (!cmpspec (opcode[i].constraints, exps, count))
          {
            int insn_size = stm8_compute_insn_size (opcode[i]);
            char *frag = frag_more (insn_size);
            int opcode_length = stm8_opcode_size (opcode[i].bin_opcode);
            bfd_put_bits (opcode[i].bin_opcode, frag, opcode_length * 8, true);
            frag += opcode_length;

            /* mov insn operands are reversed */
            if ((opcode[i].bin_opcode == 0x35)
                || (opcode[i].bin_opcode == 0x45)
                || (opcode[i].bin_opcode == 0x55))
            {
              count = -count;
            }
            stm8_bfd_out (opcode[i], exps, count, frag);
            break;
          }
    }
  if (!opcode[i].name)
    as_bad ("Invalid instruction: %s", str_orig);
  input_line_pointer = t;
  free (str_orig);
}

/* If you define this macro, it should return the position from which
   the PC relative adjustment for a PC relative fixup should be made.
   On many processors, the base of a PC relative instruction is the
   next instruction, so this macro would return the length of an
   instruction, plus the address of the PC relative fixup.  The latter
   can be calculated as fixp->fx_where +
   fixp->fx_frag->fr_address.  */

long
md_pcrel_from_section (fixS *fixp, segT sec)
{
  if (fixp->fx_addsy != (symbolS *)NULL
      && (!S_IS_DEFINED (fixp->fx_addsy)
          || (S_GET_SEGMENT (fixp->fx_addsy) != sec)))
    return 0;

  return fixp->fx_size + fixp->fx_where + fixp->fx_frag->fr_address;
  // return fixp->fx_frag->fr_address+fixp->fx_frag->fr_fix;
  return fixp->fx_frag->fr_address + fixp->fx_where;
}

int
stm8_need_index_operator ()
{
  return 1;
}

operatorT
stm8_operator (const char *name ATTRIBUTE_UNUSED,
               unsigned int operands ATTRIBUTE_UNUSED,
               char *pc ATTRIBUTE_UNUSED)
{
  return O_absent;
}

void
stm8_check_label (symbolS *labelsym ATTRIBUTE_UNUSED)
{
}

extern void
stm8_symbol_new_hook (symbolS *labelsym)
{
  char *name;
  char *p;
  int value;

  name = (char *)S_GET_NAME (labelsym);
  if ((p = strstr (name, ".b")))
    {
      if (*(p + 2) == 0)
        {
          *p = 0;
          S_SET_NAME (labelsym, name);
          value = 1;
          symbol_set_tc (labelsym, &value);
        }
    }
}
